---
kind: other
id: Methods.T:Autodesk.Revit.Exceptions.InvalidObjectException
source: html/2468f989-8f49-8003-f61e-6d7928f67f2b.htm
---
# InvalidObjectException Methods

Retrieves data needed to serialize the target object.